Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
on.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2FAR7Y2HJFNHN]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=ie44xht6ej-prod-*/*]
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=be0a849f-51d7-4ddf-92cd-abc8d8b4dc03]
module.webgui.null_resource.s3-upload: Refreshing state... [id=2068006043]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E2XZRLPU5KNENQ]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=1726937389]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=1703292191]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20241204060930481800000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-05-28T02:25:55.000+0000" -> "2025-05-29T06:33:58.000+0000"
      ~ source_code_size               = 14162132 -> 14162120
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-05-28T02:25:45.000+0000" -> "2025-05-29T06:25:46.000+0000"
      ~ source_code_size               = 11299736 -> 11299718
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:22f7e9f30ecf634ab95eefc1b08f7f68868778aa4d2a869767759802e2d95581307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:22f7e9f30ecf634ab95eefc1b08f7f68868778aa4d2a869767759802e2d95581" -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.cognito.aws_iam_policy.admin_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "admin_group_role_policy" {
        id               = "arn:aws:iam::307946671795:policy/gaspi-admin-group-role-policy"
        name             = "gaspi-admin-group-role-policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:s3:::gaspi-dataportal-*/projects/*" -> "arn:aws:s3:::gasi-dataportal-*/projects/*"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource  = "arn:aws:s3:::gaspi-dataportal-*" -> "arn:aws:s3:::gasi-dataportal-*"
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource = "arn:aws:s3:::gaspi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*" -> "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "manager_group_role_policy" {
        id               = "arn:aws:iam::307946671795:policy/gaspi-manager-group-role-policy"
        name             = "gaspi-manager-group-role-policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:s3:::gaspi-dataportal-*/projects/*" -> "arn:aws:s3:::gasi-dataportal-*/projects/*"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource  = "arn:aws:s3:::gaspi-dataportal-*" -> "arn:aws:s3:::gasi-dataportal-*"
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource = "arn:aws:s3:::gaspi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*" -> "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "pricing:*"
                        Effect   = "Allow"
                        Resource = "*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role_policy.gaspi_authenticated will be updated in-place
  ~ resource "aws_iam_role_policy" "gaspi_authenticated" {
        id          = "gaspi_authenticated:authenticated_policy"
        name        = "authenticated_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource  = "arn:aws:s3:::gaspi-dataportal-*" -> "arn:aws:s3:::gasi-dataportal-*"
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource = "arn:aws:s3:::gaspi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*" -> "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup",
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-readonly-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "athena-readonly-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup",
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinical-annotations",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinical-variants",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-pricing-cache",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-saved-queries",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "pricing:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:307946671795:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:ListNotebookInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::307946671795:role/sbeacon_backend_sagemaker_jupyter_instance_role",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                  + "private/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20241204060929941500000004",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-generateCohortVCfs",
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-generateReports",
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-indexer",
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-submitDataset",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.ec2_deidentification_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_deidentification_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "extra-glue-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListAllMyBuckets",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-deidentifyFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-deidentifyFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:HeadObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::307946671795:role/sbeacon_backend_ec2_deidentification_instance_role",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-updateFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
    }

  # module.sbeacon.aws_athena_workgroup.sbeacon-workgroup will be updated in-place
  ~ resource "aws_athena_workgroup" "sbeacon-workgroup" {
        id            = "query_workgroup"
        name          = "query_workgroup"
        tags          = {}
        # (5 unchanged attributes hidden)

      ~ configuration {
            # (5 unchanged attributes hidden)

          ~ result_configuration {
              ~ output_location       = "s3://gaspi-metadata-20250110044708770100000001/query-results/" -> (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_index_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_index_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:307946671795:stack/sbeacon-terms-index-stack/5a966b90-b206-11ef-afd3-06f4ba1dc8c3"
        name               = "sbeacon-terms-index-stack"
      ~ outputs            = {} -> (known after apply)
        tags               = {}
      ~ template_body      = jsonencode(
            {
              - Parameters = {
                  - DatabaseName = {
                      - Type = "String"
                    }
                  - TableName    = {
                      - Type = "String"
                    }
                }
              - Resources  = {
                  - SBeaconTermsGlueCatalogTable = {
                      - Properties = {
                          - CatalogId    = {
                              - Ref = "AWS::AccountId"
                            }
                          - DatabaseName = {
                              - Ref = "DatabaseName"
                            }
                          - TableInput   = {
                              - Name              = {
                                  - Ref = "TableName"
                                }
                              - Parameters        = {
                                  - EXTERNAL       = "TRUE"
                                  - numFiles       = "-1"
                                  - "orc.compress" = "SNAPPY"
                                }
                              - PartitionKeys     = [
                                  - {
                                      - Comment = "partition by kind"
                                      - Name    = "kind"
                                      - Type    = "string"
                                    },
                                ]
                              - StorageDescriptor = {
                                  - Columns      = [
                                      - {
                                          - Name = "id"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "term"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "_projectname"
                                          - Type = "string"
                                        },
                                    ]
                                  - InputFormat  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
                                  - Location     = "s3://gaspi-metadata-20250110044708770100000001/terms-index"
                                  - OutputFormat = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"
                                  - SerdeInfo    = {
                                      - Name                 = "ORC"
                                      - Parameters           = {
                                          - "hive.orc.use-column-names" = "TRUE"
                                          - "orc.column.index.access"   = "FALSE"
                                          - "serialization.format"      = "1"
                                        }
                                      - SerializationLibrary = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
                                    }
                                }
                              - TableType         = "EXTERNAL_TABLE"
                            }
                        }
                      - Type       = "AWS::Glue::Table"
                    }
                }
            }
        ) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:307946671795:stack/sbeacon-terms-stack/596c4370-b206-11ef-b6b3-0ef89e602338"
        name               = "sbeacon-terms-stack"
      ~ outputs            = {} -> (known after apply)
        tags               = {}
      ~ template_body      = jsonencode(
            {
              - Parameters = {
                  - DatabaseName = {
                      - Type = "String"
                    }
                  - TableName    = {
                      - Type = "String"
                    }
                }
              - Resources  = {
                  - SBeaconTermsGlueCatalogTable = {
                      - Properties = {
                          - CatalogId    = {
                              - Ref = "AWS::AccountId"
                            }
                          - DatabaseName = {
                              - Ref = "DatabaseName"
                            }
                          - TableInput   = {
                              - Name              = {
                                  - Ref = "TableName"
                                }
                              - Parameters        = {
                                  - EXTERNAL       = "TRUE"
                                  - numFiles       = "-1"
                                  - "orc.compress" = "SNAPPY"
                                }
                              - PartitionKeys     = [
                                  - {
                                      - Comment = "partition by kind"
                                      - Name    = "kind"
                                      - Type    = "string"
                                    },
                                ]
                              - StorageDescriptor = {
                                  - Columns      = [
                                      - {
                                          - Name = "term"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "label"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "type"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "_projectname"
                                          - Type = "string"
                                        },
                                    ]
                                  - InputFormat  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
                                  - Location     = "s3://gaspi-metadata-20250110044708770100000001/terms"
                                  - OutputFormat = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"
                                  - SerdeInfo    = {
                                      - Name                 = "ORC"
                                      - Parameters           = {
                                          - "hive.orc.use-column-names" = "TRUE"
                                          - "orc.column.index.access"   = "FALSE"
                                          - "serialization.format"      = "1"
                                        }
                                      - SerializationLibrary = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
                                    }
                                }
                              - TableType         = "EXTERNAL_TABLE"
                            }
                        }
                      - Type       = "AWS::Glue::Table"
                    }
                }
            }
        ) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_analyses"
        name               = "sbeacon_analyses"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/analyses" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_analyses_cache"
        name               = "sbeacon_analyses_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/analyses-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_biosamples"
        name               = "sbeacon_biosamples"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/biosamples" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (23 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_biosamples_cache"
        name               = "sbeacon_biosamples_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/biosamples-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (23 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_datasets"
        name               = "sbeacon_datasets"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/datasets" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_datasets_cache"
        name               = "sbeacon_datasets_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/datasets-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_individuals"
        name               = "sbeacon_individuals"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/individuals" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (16 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_individuals_cache"
        name               = "sbeacon_individuals_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/individuals-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (16 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-relations" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_relations"
        name               = "sbeacon_relations"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/relations" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/runs" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_runs_cache"
        name               = "sbeacon_runs_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/runs-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-terms-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-terms-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_terms_cache"
        name               = "sbeacon_terms_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/terms-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (7 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be updated in-place
  ~ resource "aws_iam_policy" "extra-glue-policy" {
        id               = "arn:aws:iam::307946671795:policy/extra-glue-policy"
        name             = "extra-glue-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:ListAllMyBuckets",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_deidentification_policy" {
        id          = "sbeacon_backend_ec2_deidentification_instance_role:sbeacon_backend_ec2_deidentification_policy"
        name        = "sbeacon_backend_ec2_deidentification_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:44" -> (known after apply)
      ~ code_sha256                 = "C59gD3HZFxMNpT5ezWVWErHOJhUxYgc/qBTZVSUkKd8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-28T01:53:46.168+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:44" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Uw1w0f/aO45ErVDpnsw4dExWwS1sXzlR60+wUjCpctk0uK5Rftx29IiSj3Ln/x1JsbKUh5xc6bNRsAUdAyCgQQ==" -> "f5hTpymQdi+CFeJzNy6YiZIJJPx0KEqwEvGqKVvYBfdOi/UI53ROuHs0zvTXIZDFNWwzUciUeto1/1xTeMC5Dg==" # forces replacement
      ~ source_code_size            = 18105217 -> (known after apply)
      ~ version                     = "44" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_permission.S3deidentifyFiles must be replaced
-/+ resource "aws_lambda_permission" "S3deidentifyFiles" {
      ~ id                  = "SBeaconBackendAllowS3deidentifyFilesInvoke" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_permission.S3updateFiles must be replaced
-/+ resource "aws_lambda_permission" "S3updateFiles" {
      ~ id                  = "SBeaconBackendAllowS3updateFilesInvoke" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket must be replaced
+/- resource "aws_s3_bucket" "dataportal-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002" -> (known after apply)
      ~ bucket                      = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-dataportal-20250110044710445000000002.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-dataportal-" -> "gasi-dataportal-" # forces replacement
      ~ bucket_regional_domain_name = "gaspi-dataportal-20250110044710445000000002.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)
      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "POST",
              - "GET",
              - "HEAD",
              - "DELETE",
              - "PUT",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [
              - "x-amz-multipart-parts-count",
              - "x-amz-abort-date",
              - "ETag",
            ] -> null
          - max_age_seconds = 36000 -> null
        }

      ~ grant (known after apply)
      - grant {
          - id          = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "remove-zombie-staging-files" -> null
          - prefix                                 = "staging/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 3 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "expire-noncurrent-versions" -> null
          - prefix                                 = "staging/" -> null
          - tags                                   = {} -> null

          - noncurrent_version_expiration {
              - days = 1 -> null
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket must be replaced
+/- resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-lambda-layers-20250110044710445300000003" -> (known after apply)
      ~ bucket                      = "gaspi-lambda-layers-20250110044710445300000003" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-lambda-layers-20250110044710445300000003.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-lambda-layers-" -> "gasi-lambda-layers-" # forces replacement
      ~ bucket_regional_domain_name = "gaspi-lambda-layers-20250110044710445300000003.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-lambda-layers-20250110044710445300000003" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.metadata-bucket must be replaced
+/- resource "aws_s3_bucket" "metadata-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-metadata-20250110044708770100000001" -> (known after apply)
      ~ bucket                      = "gaspi-metadata-20250110044708770100000001" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-metadata-20250110044708770100000001.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-metadata-" -> "gasi-metadata-" # forces replacement
      ~ bucket_regional_domain_name = "gaspi-metadata-20250110044708770100000001.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-metadata-20250110044708770100000001" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)
      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "GET",
              - "HEAD",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [] -> null
          - max_age_seconds = 3000 -> null
        }

      ~ grant (known after apply)
      - grant {
          - id          = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-query-results" -> null
          - prefix                                 = "query-results/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 2 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-cached-results" -> null
          - prefix                                 = "query-responses/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 2 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket must be replaced
+/- resource "aws_s3_bucket" "variants-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-variants-20250110044711919900000004" -> (known after apply)
      ~ bucket                      = "gaspi-variants-20250110044711919900000004" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-variants-20250110044711919900000004.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-variants-" -> "gasi-variants-" # forces replacement
      ~ bucket_regional_domain_name = "gaspi-variants-20250110044711919900000004.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-variants-20250110044711919900000004" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-queries" -> null
          - prefix                                 = "variant-queries/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 1 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.dataportal_bucket_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "dataportal_bucket_acl" {
      ~ bucket                = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250110044710445000000002,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.lambda-layers must be replaced
-/+ resource "aws_s3_bucket_acl" "lambda-layers" {
      ~ bucket                = "gaspi-lambda-layers-20250110044710445300000003" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-lambda-layers-20250110044710445300000003,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.metadata must be replaced
-/+ resource "aws_s3_bucket_acl" "metadata" {
      ~ bucket                = "gaspi-metadata-20250110044708770100000001" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-metadata-20250110044708770100000001,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.variants_bucket_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "variants_bucket_acl" {
      ~ bucket                = "gaspi-variants-20250110044711919900000004" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-variants-20250110044711919900000004,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.dataportal-bucket must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "dataportal-bucket" {
      ~ bucket                = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.metadata-bucket must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "metadata-bucket" {
      ~ bucket                = "gaspi-metadata-20250110044708770100000001" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-metadata-20250110044708770100000001" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.metadata_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "metadata_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-metadata-20250110044708770100000001" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-metadata-20250110044708770100000001" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.staging_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "staging_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.variants_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "variants_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-variants-20250110044711919900000004" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-variants-20250110044711919900000004" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles must be replaced
-/+ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ bucket      = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      ~ id          = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ lambda_function {
          ~ id                  = "tf-s3-lambda-20250110044820597700000007" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ lambda_function {

```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.